
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12742361654)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_security_group.this[&#34;vpc_endpoint&#34;]
  * aws_subnet.this[&#34;private_vpc_endpoint_1a&#34;]
  * aws_subnet.this[&#34;private_vpc_endpoint_1c&#34;]
  * aws_vpc_endpoint.interface[&#34;ecr_api&#34;]
  * aws_vpc_endpoint.interface[&#34;ecr_dkr&#34;]
  * aws_vpc_endpoint.s3_gateway
  * aws_vpc_security_group_egress_rule.vpc_endpoint


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_security_group.this["vpc_endpoint"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpc_endpoint"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "vpc_endpoint"
        }
      + tags_all               = {
          + "Managed" = "Terraform"
          + "Name"    = "vpc_endpoint"
        }
      + vpc_id                 = "vpc-04a61e17cecb81c94"
    }

  # aws_subnet.this["private_vpc_endpoint_1a"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.248.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private_vpc_endpoint_1a"
        }
      + tags_all                                       = {
          + "Managed" = "Terraform"
          + "Name"    = "private_vpc_endpoint_1a"
        }
      + vpc_id                                         = "vpc-04a61e17cecb81c94"
    }

  # aws_subnet.this["private_vpc_endpoint_1c"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.249.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private_vpc_endpoint_1c"
        }
      + tags_all                                       = {
          + "Managed" = "Terraform"
          + "Name"    = "private_vpc_endpoint_1c"
        }
      + vpc_id                                         = "vpc-04a61e17cecb81c94"
    }

  # aws_vpc_endpoint.interface["ecr_api"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "ecr_api"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_api"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.interface["ecr_dkr"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "ecr_dkr"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_dkr"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3_gateway will be created
  + resource "aws_vpc_endpoint" "s3_gateway" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-00bfb2a9a2de18751",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3_gateway"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "s3_gateway"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_security_group_egress_rule.vpc_endpoint will be created
  + resource "aws_vpc_security_group_egress_rule" "vpc_endpoint" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Managed" = "Terraform"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"5dafa980a630b035ac92c7628b10ab1b1fde8a32","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->